Config/Catalogs/ПервичныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПервичныеДокументы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ПервичныеДокументыБГУКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Первичный документ.
// 
// Параметры:
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.ПервичныеДокументы - Первичный документ
Функция ПервичныйДокумент(Идентификатор) Экспорт
	#Если Клиент Тогда
	ВсеПервичныеДокументы = Неопределено;
	СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента()
		.Свойство("ПараметрыБГУ_ПервичныеДокументы", ВсеПервичныеДокументы);
	#Иначе
	ВсеПервичныеДокументы = ПервичныеДокументыБГУПовтИсп.ВсеПервичныеДокументы(); // ФиксированноеСоответствие из Строка
	#КонецЕсли
	Если ТипЗнч(ВсеПервичныеДокументы) = Тип("ФиксированноеСоответствие") Тогда
		Результат = ВсеПервичныеДокументы.Получить(Идентификатор); // СправочникСсылка.ПервичныеДокументы
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	Возврат ПредопределенноеЗначение("Справочник.ПервичныеДокументы.ПустаяСсылка");
КонецФункции

// Выбран указанный первичный документ.
// 
// Параметры:
//  Значение - СправочникСсылка.ПервичныеДокументы
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  Булево - Выбран указанный первичный документ
Функция ВыбранУказанныйПервичныйДокумент(Значение, Идентификатор) Экспорт
	Возврат ЗначениеЗаполнено(Идентификатор)
		И ЗначениеЗаполнено(Значение)
		И Значение = ПервичныйДокумент(Идентификатор);
КонецФункции

// При изменении ключевого реквизита.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//   * Объект - ДанныеФормыСтруктура:
//    ** ПервичныйДокумент - СправочникСсылка.ПервичныеДокументы
Процедура ПриИзмененииКлючевогоРеквизита(Форма) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
			Или Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ПервичныйДокумент") Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьВидыПервичныхДокументов(Форма);
	Если ЗначениеЗаполнено(Форма.Объект.ПервичныйДокумент)
		И Форма.Элементы.ПервичныйДокумент.СписокВыбора.НайтиПоЗначению(Форма.Объект.ПервичныйДокумент) = Неопределено Тогда
		
		Форма.Объект.ПервичныйДокумент = ПредопределенноеЗначение("Справочник.ПервичныеДокументы.ПустаяСсылка");
	КонецЕсли;
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(Форма, Форма.Объект);
КонецПроцедуры

// Заполнить виды первичных документов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//   * ПараметрыПодключаемыхКоманд - Структура
//   * Элементы - ВсеЭлементыФормы:
//     ** ПервичныйДокумент - ПолеФормы
//   * ПараметрыПечатныхФорм - Структура из см. ПустаяСтрокаПараметраПечатныхФорм
//
Процедура ОбновитьВидыПервичныхДокументов(Форма) Экспорт
	
	СписокПечатныхФорм = Форма.Элементы.ПервичныйДокумент.СписокВыбора; // СписокЗначений
	СписокПечатныхФорм.Очистить();
	Объект = Форма.Объект;
	
	Для Каждого Строка Из Форма.ПараметрыПечатныхФорм Цикл
		Если УсловияВидимостиКомандыПечатиВыполняются(Строка.Значение.УсловияВидимости, Объект) Тогда
			СписокПечатныхФорм.Добавить(Строка.Значение.ВидПервичногоДокумента, Строка.Значение.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УсловияВидимостиКомандыПечатиВыполняются(Условия, ЗначенияРеквизитов)
	Если Не ЗначениеЗаполнено(Условия) Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого Условие Из Условия Цикл
		ИмяРеквизита = Условие.Реквизит;
		Если Не ЗначенияРеквизитов.Свойство(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяРеквизита = "ПервичныйДокумент" Тогда
			Продолжить;
		КонецЕсли;
		УсловиеВыполняется = Истина;
		Если Условие.ВидСравнения = ВидСравнения.Равно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] = Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.Больше
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] > Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.БольшеИлиРавно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] >= Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.Меньше
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] < Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.МеньшеИлиРавно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] <= Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.НеРавно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] <> Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.ВСписке
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			Если ТипЗнч(Условие.Значение) = Тип("СписокЗначений") Тогда
				УсловиеВыполняется = Условие.Значение.НайтиПоЗначению(ЗначенияРеквизитов[ИмяРеквизита]) <> Неопределено;
			Иначе // Массив
				УсловиеВыполняется = Условие.Значение.Найти(ЗначенияРеквизитов[ИмяРеквизита]) <> Неопределено;
			КонецЕсли;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.НеВСписке
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
			Если ТипЗнч(Условие.Значение) = Тип("СписокЗначений") Тогда
				УсловиеВыполняется = Условие.Значение.НайтиПоЗначению(ЗначенияРеквизитов[ИмяРеквизита]) = Неопределено;
			Иначе // Массив
				УсловиеВыполняется = Условие.Значение.Найти(ЗначенияРеквизитов[ИмяРеквизита]) = Неопределено;
			КонецЕсли;
		ИначеЕсли Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
			УсловиеВыполняется = ЗначениеЗаполнено(ЗначенияРеквизитов[ИмяРеквизита]);
		ИначеЕсли Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
			УсловиеВыполняется = Не ЗначениеЗаполнено(ЗначенияРеквизитов[ИмяРеквизита]);
		КонецЕсли;
		Если Не УсловиеВыполняется Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

#КонецОбласти
